src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
  <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 04.08.2026</comment>
</mdclass:DataProcessor>

src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 04.08.2026</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Сотрудник) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	
	Набор.Отбор.Сотрудник.Установить(Сотрудник);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		
		Если Не Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				
				Запись = Набор.Добавить();
				Запись.Сотрудник = Сотрудник;
				Запись.Дата = Дат;
				Запись.Значение = 1;
				
		КонецЕсли;
		
		Дат = Дат + ЧислоСекундВСутках;
				
	КонецЦикла;
		
	Набор.Записать();
	
КонецПроцедуры
